Revit 2024 API
IFCAnyHandle.GetAttribute Method
 Gets the attribute by name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCData GetAttribute(
	string name
)
Visual Basic
Public Function GetAttribute ( _
	name As String _
) As IFCData
Visual C++
public:
IFCData^ GetAttribute(
	String^ name
)
Parameters
name
Type: System.String
 The name.
Return Value
 The value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace